app/Controllers/Admin/Users.php

SELECT *
FROM `users`
WHERE `role` != 'admin'
ORDER BY `created_at` DESC
---
    public function index()
    {
        $users = $this->model->where('role !=', UserModel::ROLE_ADMIN)
                             ->orderBy('created_at', 'desc')
                             ->findAll();