app/Models/FailedMovies.php

SELECT COUNT(*) AS `numrows`
FROM `failed_movies`
---
    public static function getPendingCount()
    {
        $self = new self();
        return $self->select('id')
                    ->countAllResults();