app/Models/SettingsModel.php

SELECT *
FROM `settings`
WHERE `name` = '__t'
 LIMIT 1
---
    public function getConfig( $name )
    {
        if(empty($name))
            return null;

        return $this->where('name', $name)
                    ->first();