app/Models/UserModel.php

    public function getUser( $id )
    {
        return $this->where('id', $id)
                    ->first();
---
SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1