app/Libraries/Analytics.php

SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE DATE_FORMAT(created_at, "%Y-%m-%d") = '2022-06-15'
---
    public function initUsers()
    {
        $builder = $this->db->table('users');

        //total users
        $total = $builder->countAll() - 1;

        // get users who is registered in current day
        $today =  $this->todayData( $builder)
                       ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `requests`
WHERE `status` = 'pending'
---
    public function initMoviesRequests()
    {
        $builder = $this->db->table('requests');

        $pending = $builder->where('status', 'pending')
                           ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `payouts`
WHERE `status` = 'pending'
---
    public function initPayouts()
    {
        $builder = $this->db->table('payouts');

        $pending = $builder->where('status', PayoutsModel::STATUS_PENDING)
                         ->countAllResults();

SELECT SUM(`stars`) AS `stars`
FROM `earnings`
WHERE `status` = 'credited'
SELECT SUM(`stars`) AS `stars`
FROM `payouts`
WHERE `status` = 'completed'
---
    public function initUsersAccBalance()
    {
        $builder = $this->db->table('earnings');

        //get earned stars
        $earnedStars = (int) $builder->where('status', EarningsModel::STATUS_CREDITED)
                                     ->selectSum('stars')
                                     ->get()
                                     ->getRow()
                                      ->stars;


        // get redeem stars
        $builder = $this->db->table('payouts');
        $redeem = (int) $builder->where('status', PayoutsModel::STATUS_COMPLETED)
                                ->selectSum('stars')
                                ->get()
                                ->getRow()
                                ->stars;

SELECT COUNT(*) AS `numrows`
FROM `links`
WHERE `status` = 'active'
AND `user_id` != '1'
SELECT COUNT(*) AS `numrows`
FROM `links`
WHERE `status` = 'pending'
AND `user_id` != '1'
SELECT COUNT(*) AS `numrows`
FROM `links`
WHERE `status` = 'rejected'
AND `user_id` != '1'
---
    public function initUsersLinks()
    {
        $builder = $this->db->table('links');

        // approved links
        $approved = $builder->where('status', LinkModel::STATUS_APPROVED)
                            ->where('user_id !=', '1')
                            ->countAllResults();
        // pending links
        $pending = $builder->where('status', LinkModel::STATUS_PENDING)
                            ->where('user_id !=', '1')
                            ->countAllResults();

        // pending links
        $rejected = $builder->where('status', LinkModel::STATUS_REJECTED)
                            ->where('user_id !=', '1')
                            ->countAllResults();

SELECT SUM(`visitors`.`views`) AS `views`
FROM `visitors`
LEFT JOIN `movies` ON `movies`.`id` = `visitors`.`movie_id`
WHERE `movies`.`type` = 'movie'
SELECT COUNT(*) AS `numrows`
FROM `visitors`
LEFT JOIN `movies` ON `movies`.`id` = `visitors`.`movie_id`
WHERE `movies`.`type` = 'movie'
SELECT SUM(`visitors`.`views`) AS `views`
FROM `visitors`
LEFT JOIN `movies` ON `movies`.`id` = `visitors`.`movie_id`
WHERE `movies`.`type` = 'episode'
SELECT COUNT(*) AS `numrows`
FROM `visitors`
LEFT JOIN `movies` ON `movies`.`id` = `visitors`.`movie_id`
WHERE `movies`.`type` = 'episode'
SELECT SUM(`visitors`.`views`) AS `views`
FROM `visitors`
LEFT JOIN `movies` ON `movies`.`id` = `visitors`.`movie_id`
WHERE `movies`.`type` = 'movie'
AND `visitors`.`ref_user_id` != ''
SELECT COUNT(*) AS `numrows`
FROM `visitors`
LEFT JOIN `movies` ON `movies`.`id` = `visitors`.`movie_id`
WHERE `movies`.`type` = 'movie'
AND `visitors`.`ref_user_id` != ''
SELECT SUM(`visitors`.`views`) AS `views`
FROM `visitors`
LEFT JOIN `movies` ON `movies`.`id` = `visitors`.`movie_id`
WHERE `movies`.`type` = 'episode'
AND `visitors`.`ref_user_id` != ''
SELECT COUNT(*) AS `numrows`
FROM `visitors`
LEFT JOIN `movies` ON `movies`.`id` = `visitors`.`movie_id`
WHERE `movies`.`type` = 'episode'
AND `visitors`.`ref_user_id` != ''
---
    public function initViews()
    {
        $builder = $this->db->table('visitors');

        //get total views for movies
        $totalMovies = $builder->join('movies', 'movies.id = visitors.movie_id', 'LEFT')
                         ->where('movies.type', 'movie')
                         ->selectSum('visitors.views')
                         ->get()
                         ->getFirstRow()
                         ->views;

        //get unique views for movies
        $uniqMovies = $builder->join('movies', 'movies.id = visitors.movie_id', 'LEFT')
                              ->where('movies.type', 'movie')
                              ->countAllResults();

        //get total views for episode
        $totalEpisodes = $builder->join('movies', 'movies.id = visitors.movie_id', 'LEFT')
                                 ->where('movies.type', 'episode')
                                 ->selectSum('visitors.views')
                                 ->get()
                                 ->getFirstRow()
                                 ->views;

        //get unique views for episode
        $uniqEpisodes = $builder->join('movies', 'movies.id = visitors.movie_id', 'LEFT')
                                 ->where('movies.type', 'episode')
                                 ->countAllResults();

        //get total referrals for movies
        $totalMoviesRef = $builder->join('movies', 'movies.id = visitors.movie_id', 'LEFT')
                            ->where('movies.type', 'movie')
                            ->where('visitors.ref_user_id !=', '')
                            ->selectSum('visitors.views')
                            ->get()
                            ->getFirstRow()
                            ->views;

        //get unique referrals for movies
        $uniqMoviesRef = $builder->join('movies', 'movies.id = visitors.movie_id', 'LEFT')
                                 ->where('movies.type', 'movie')
                                 ->where('visitors.ref_user_id !=', '')
                                 ->countAllResults();

        //get total referrals for movies
        $totalEpisodesRef = $builder->join('movies', 'movies.id = visitors.movie_id', 'LEFT')
                                 ->where('movies.type', 'episode')
                                 ->where('visitors.ref_user_id !=', '')
                                 ->selectSum('visitors.views')
                                 ->get()
                                 ->getFirstRow()
                                 ->views;

        //get unique referrals for movies
        $uniqEpisodesRef = $builder->join('movies', 'movies.id = visitors.movie_id', 'LEFT')
            ->where('movies.type', 'episode')
            ->where('visitors.ref_user_id !=', '')
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `movies`
WHERE `type` = 'movie'
SELECT COUNT(*) AS `numrows`
FROM `movies`
WHERE DATE_FORMAT(created_at, "%Y-%m-%d") = '2022-06-15'
AND `type` = 'movie'
SELECT COUNT(*) AS `numrows`
FROM (
SELECT `movies`.`id`
FROM `movies`
JOIN `links` ON `links`.`movie_id` = `movies`.`id`
WHERE `movies`.`type` = 'movie'
AND `links`.`type` = 'stream'
GROUP BY `movies`.`id`
) CI_count_all_results
---
    protected function initMovies()
    {
        $builder = $this->db->table('movies');

        //get total movies
        $total = $builder->where('type', 'movie')
                         ->countAllResults();

        //get today added movies
        $today = $this->todayData( $builder )->where('type', 'movie')
                                             ->countAllResults();

        //movies with links
        $with_links = $builder->join('links', 'links.movie_id = movies.id')
                              ->select('movies.id')
                              ->where('movies.type', 'movie')
                              ->where('links.type', 'stream')
                              ->groupBy('movies.id')
                              ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `series`
SELECT COUNT(*) AS `numrows`
FROM `series`
WHERE DATE_FORMAT(created_at, "%Y-%m-%d") = '2022-06-15'
SELECT COUNT(*) AS `numrows`
FROM `series`
WHERE `is_completed` = 1
---
    protected function initSeries()
    {
        $builder = $this->db->table('series');

        //get total series
        $total = $builder->countAllResults();

        //get today added series
        $today = $this->todayData( $builder )
                      ->countAllResults();

        //completed series
        $completed = $builder->where('is_completed', 1)
                             ->countAllResults();

SELECT SUM(`total_episodes`) AS `total_episodes`
FROM `seasons`
SELECT COUNT(*) AS `numrows`
FROM `movies`
WHERE `type` = 'episode'
SELECT COUNT(*) AS `numrows`
FROM `movies`
WHERE DATE_FORMAT(created_at, "%Y-%m-%d") = '2022-06-15'
AND `type` = 'episode'
SELECT COUNT(*) AS `numrows`
FROM (
SELECT `movies`.`id`
FROM `movies`
JOIN `links` ON `links`.`movie_id` = `movies`.`id`
WHERE `movies`.`type` = 'episode'
AND `links`.`type` = 'stream'
GROUP BY `movies`.`id`
) CI_count_all_results
---
    protected function initEpisodes()
    {
        $builder = $this->db->table('movies');

        //total episodes
        $total = $this->db->table('seasons')
                                  ->selectSum('total_episodes')
                                  ->get()
                                  ->getFirstRow()
                                  ->total_episodes;


        //completed episodes
        $completed = $builder->where('type', 'episode')
                             ->countAllResults();

        //today added
        $today = $this->todayData( $builder )
                      ->where('type', 'episode')
                      ->countAllResults();

        $incomplete = $total - $completed;
        if($incomplete < 0) $incomplete = 0;

        //completion rate
        $completion_rate = $total > 0 ? round( $completed / $total * 100 ) : 0;

        //episodes with links
        $with_links = $builder->join('links', 'links.movie_id = movies.id')
                              ->select('movies.id')
                              ->where('movies.type', 'episode')
                              ->where('links.type', 'stream')
                              ->groupBy('movies.id')
                              ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `links`
SELECT COUNT(*) AS `numrows`
FROM `links`
WHERE `type` = 'stream'
SELECT COUNT(*) AS `numrows`
FROM `links`
WHERE `type` = 'direct_dl'
---
    protected function initLinks()
    {
        $builder = $this->db->table('links');

        //total links
        $total = $builder->countAllResults();

        //streaming links
        $stream =  $builder->where('type', LinkModel::TYPE_STREAM)
                           ->countAllResults();

        //direct download links
        $direct_dl =  $builder->where('type', LinkModel::TYPE_DIRECT_DL)
                              ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `movies`
SELECT COUNT(*) AS `numrows`
FROM (
SELECT `movies`.`id`
FROM `movies`
JOIN `links` ON `links`.`movie_id` = `movies`.`id`
WHERE `links`.`type` = 'stream'
GROUP BY `movies`.`id`
) CI_count_all_results
SELECT COUNT(*) AS `numrows`
FROM (
SELECT `movies`.`id`
FROM `movies`
JOIN `links` ON `links`.`movie_id` = `movies`.`id`
WHERE `links`.`type` != 'stream'
GROUP BY `movies`.`id`
) CI_count_all_results
---
    protected function initLinksCompletion()
    {
        $builder = $this->db->table('movies');

        //get total movies
        $total = $builder->countAllResults();

        //streaming links completion
        $with = $builder->join('links', 'links.movie_id = movies.id')
                        ->select('movies.id')
                        ->where('links.type', 'stream')
                        ->groupBy('movies.id')
                        ->countAllResults();

        $without = $total - $with;
        $completion_rate = 0;
        if($total > 0){
            $completion_rate = $total > 0 ? floor( $with / $total * 100 ) : 0;
        }

        $data['stream'] = compact('with', 'without', 'completion_rate');


        //download links completion
        $with = $builder->join('links', 'links.movie_id = movies.id')
                        ->select('movies.id')
                        ->where('links.type !=', 'stream')
                        ->groupBy('movies.id')
                        ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `movies`
SELECT COUNT(*) AS `numrows`
FROM `failed_movies`
---
    protected function calcCoverage()
    {
        //get total movies
        $total = $this->db->table('movies')
                          ->countAllResults();

        //get failed movies
        $failed = $this->db->table('failed_movies')
                           ->countAllResults();

SELECT SUM(`requests`) AS `requests`
FROM `links`
WHERE `type` = 'stream'
---
    protected function __countLinksRequests(?string $type = '')
    {
        $builder = $this->db->table('links');

        if(! empty( $type ))
            $builder->where('type', $type);

        $requests = $builder->selectSum('requests')
                            ->get()
                            ->getFirstRow()
                            ->requests;

SELECT COUNT(*) AS `numrows`
FROM `links`
WHERE `type` = 'stream'
AND   (
`reports_not_working` > 0
OR `reports_wrong_link` > 0
 )
---
    protected function __countReportedLinks(?string $type = '')
    {
        $builder = $this->db->table('links');

        if(! empty( $type ))
            $builder->where('type', $type);

        return $builder->groupStart()
                            ->where('reports_not_working >', 0)
                            ->orWhere('reports_wrong_link >', 0)
                        ->groupEnd()
                       ->countAllResults();